In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
label = ["a", "b", "c"]
arr = [22,45,88]

In [4]:
pd.Series(arr, index = label)

a    22
b    45
c    88
dtype: int64

In [5]:
ser1 = pd.Series([1,2,3,4], ["Egy", "Itl", "USA", "Jpn"])
ser2 = pd.Series([1,2,5,6], ["Egy", "Itl", "Spn", "Arg"])

In [6]:
ser2["Egy"]

1

In [7]:
rand = np.random.seed(202)

In [8]:
df = pd.DataFrame(np.random.randn(5,4) , ['A','B','C','D','E'],['X','Y','Z','W'] )

In [9]:
df

          X         Y         Z         W
A -0.735874 -0.860153 -0.923282  0.238453
B -0.583216  0.674326  0.023700  0.221119
C -0.839989 -0.124535  1.044066 -0.172601
D  1.523960 -0.556156  0.423401 -0.321324
E -1.359149  0.233465  1.546571 -0.414667

In [10]:
df[['X',"Y"]] # this only for col what if i want to get rows

          X         Y
A -0.735874 -0.860153
B -0.583216  0.674326
C -0.839989 -0.124535
D  1.523960 -0.556156
E -1.359149  0.233465

In [11]:
type(df['X']);type(df)

pandas.core.frame.DataFrame

In [12]:
df["S"] = df["X"] + df["Y"] + df["Z"] + df["W"]

In [13]:
df

          X         Y         Z         W         S
A -0.735874 -0.860153 -0.923282  0.238453 -2.280856
B -0.583216  0.674326  0.023700  0.221119  0.335928
C -0.839989 -0.124535  1.044066 -0.172601 -0.093060
D  1.523960 -0.556156  0.423401 -0.321324  1.069880
E -1.359149  0.233465  1.546571 -0.414667  0.006219

In [14]:
df.drop("W", axis=1) # axis col = 1, axis row = 0

          X         Y         Z         S
A -0.735874 -0.860153 -0.923282 -2.280856
B -0.583216  0.674326  0.023700  0.335928
C -0.839989 -0.124535  1.044066 -0.093060
D  1.523960 -0.556156  0.423401  1.069880
E -1.359149  0.233465  1.546571  0.006219

In [15]:
df.loc["A"] # to get row by label ; u can use iloc[1] to get by int

X   -0.735874
Y   -0.860153
Z   -0.923282
W    0.238453
S   -2.280856
Name: A, dtype: float64

In [16]:
df.loc[["A","B"],["X","Y"]]

          X         Y
A -0.735874 -0.860153
B -0.583216  0.674326

In [17]:
# Conditions ----------------------------------------
df[df>0]

         X         Y         Z         W         S
A      NaN       NaN       NaN  0.238453       NaN
B      NaN  0.674326  0.023700  0.221119  0.335928
C      NaN       NaN  1.044066       NaN       NaN
D  1.52396       NaN  0.423401       NaN  1.069880
E      NaN  0.233465  1.546571       NaN  0.006219

In [18]:
# df[df["X"] > 0]["X"]                            #this brings rows that cond is true
# ===
cond = df["X"] > 0
res = df[cond]
res["S"]

D    1.06988
Name: S, dtype: float64

In [19]:
boolres = df["X"] > 0
df[boolres]

         X         Y         Z         W        S
D  1.52396 -0.556156  0.423401 -0.321324  1.06988

In [20]:
df[  (df["X"] > 0)   |    (df["Y"] >1)   ]

         X         Y         Z         W        S
D  1.52396 -0.556156  0.423401 -0.321324  1.06988

In [21]:
df["Contry"] = "Egy Ity Arg Brz Ger".split()

In [22]:
df

          X         Y         Z         W         S Contry
A -0.735874 -0.860153 -0.923282  0.238453 -2.280856    Egy
B -0.583216  0.674326  0.023700  0.221119  0.335928    Ity
C -0.839989 -0.124535  1.044066 -0.172601 -0.093060    Arg
D  1.523960 -0.556156  0.423401 -0.321324  1.069880    Brz
E -1.359149  0.233465  1.546571 -0.414667  0.006219    Ger

In [23]:
df.set_index("Contry") # make Col is index

               X         Y         Z         W         S
Contry
Egy    -0.735874 -0.860153 -0.923282  0.238453 -2.280856
Ity    -0.583216  0.674326  0.023700  0.221119  0.335928
Arg    -0.839989 -0.124535  1.044066 -0.172601 -0.093060
Brz     1.523960 -0.556156  0.423401 -0.321324  1.069880
Ger    -1.359149  0.233465  1.546571 -0.414667  0.006219

In [24]:
df.reset_index() # make auto index

  index         X         Y         Z         W         S Contry
0     A -0.735874 -0.860153 -0.923282  0.238453 -2.280856    Egy
1     B -0.583216  0.674326  0.023700  0.221119  0.335928    Ity
2     C -0.839989 -0.124535  1.044066 -0.172601 -0.093060    Arg
3     D  1.523960 -0.556156  0.423401 -0.321324  1.069880    Brz
4     E -1.359149  0.233465  1.546571 -0.414667  0.006219    Ger

In [25]:
# advanced------------------------------------------

In [26]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [27]:
dff = pd.DataFrame(np.random.randn(6,2) ,hier_index, ["A" , "B"])

In [28]:
dff

             A         B
G1 1 -1.790209 -0.292157
   2 -0.331039  0.809957
   3 -1.130349 -0.387018
G2 1 -0.073094 -0.191489
   2  0.069849 -0.941902
   3 -0.729284 -0.155633

In [29]:
dff.loc["G1"].loc[1]

A   -1.790209
B   -0.292157
Name: 1, dtype: float64

In [30]:
# give our index names
dff.index.names = ["Groups", "Num"]

In [31]:
dff

                   A         B
Groups Num
G1     1   -1.790209 -0.292157
       2   -0.331039  0.809957
       3   -1.130349 -0.387018
G2     1   -0.073094 -0.191489
       2    0.069849 -0.941902
       3   -0.729284 -0.155633

In [32]:
dff.loc["G2"].loc[2]["B"];dff.xs('G2').xs(2)["B"]   # cross section

-0.9419020256242737

In [33]:
dff.xs(1, level = "Num")

               A         B
Groups
G1     -1.790209 -0.292157
G2     -0.073094 -0.191489

In [34]:
d = { 'A' : [1,2,np.nan], "B":[5, np.nan, np.nan], "c":[1,2,3] }

In [35]:
dfff = pd.DataFrame(d)
dfff

     A    B  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [36]:
dfff.dropna(thresh=2) #axis = 0; axis = 1 drop any row / col that contain nan ---- thresh = عدد الاحتواء علي الكلمه

     A    B  c
0  1.0  5.0  1
1  2.0  NaN  2

In [37]:
dfff.fillna("fill")

      A     B  c
0   1.0   5.0  1
1   2.0  fill  2
2  fill  fill  3

In [38]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df4 = pd.DataFrame(data)

In [39]:
df4

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [40]:
deta = df4.groupby("Company")

In [41]:
deta.sum().loc["FB"]["Sales"]

593

In [42]:
deta.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [43]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [44]:
pd.concat([df1,df2,df3] , axis = 0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [45]:
# pd.concat ,           pd.merge(left, right,how,on) ,                  left.join(right)

In [46]:
df5 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df5.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [47]:
df5["col2"].unique()  # unique Vale

df5["col2"].nunique()  # n of unique value

df5["col2"].value_counts()  # unique Vale

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [48]:
def time2(x):
    return x*2

In [49]:
df5["col2"].apply(time2);
df5["col2"].apply(lambda x :x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [50]:
df5["col3"].apply(len )

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [51]:
df5.sort_values("col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [52]:
df5.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [53]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df6 = pd.DataFrame(data)

In [54]:
df6.pivot_table(values = "D", index=["A","B"], columns=["C"]) # change the tablr by desired

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN